# NoiseLevels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Noise..::..NoiseLevels Property
Noise Class See Also
---
The property labeled "Levels" from the "Noise" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string NoiseLevels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoiseLevels As String
	Get
```

Visual C++
---
```text
public:
static property String^ NoiseLevels {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "1, 10".
# See Also
Noise Class
Autodesk.Revit.DB.Visual Namespace